# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'
tap 'ethereum/ethereum'

# Binaries
brew 'bash' 
brew 'bat' 
brew 'coreutils' 
brew 'fd'
brew 'git'
brew 'gnupg'
brew 'grep'
brew 'httpie'
brew 'jq' # Used for spatie/visit
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
brew 'svn' # Needed to install fonts

# Development tools
brew 'gh'
brew 'awscli'
brew 'nvm'
brew 'solidity'
brew 'k9s'
brew 'pre-commit'
brew 'go'
brew 'tilt'
brew 'node'
brew 'yarn'

# Apps
cask '1password'
cask 'discord'
# cask 'docker'
cask 'firefox'
cask 'brave-browser'
cask 'slack'
cask 'telegram-desktop'
cask 'visual-studio-code'
cask 'iterm2'
cask 'whatsapp'
cask 'zoom'
cask 'ledger-live'

# Fonts
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'
