tap 'ethereum/ethereum'
tap 'homebrew/bundle'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/cask'
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"

brew 'awscli'
brew 'bash' 
brew 'bat' 
brew 'coreutils' 
brew 'fd'
brew 'gh'
brew 'git'
brew 'gnupg'
brew 'go'
brew 'grep'
brew 'httpie'
brew 'jq' # Used for spatie/visit
brew 'k9s'
brew 'node'
brew 'nvm'
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
brew 'pre-commit'
brew 'solidity'
brew 'svn' # Needed to install fonts
brew 'tilt'
brew 'yarn'
brew "autoconf"
brew "automake"
brew "cask"
brew "cmake"
brew "coreutils"
brew "docker", link: false
brew "git"
brew "icu4c"
brew "jansson"
brew "kubernetes-cli", link: false
brew "libksba"
brew "libpng"
brew "libtool"
brew "libzip"
brew "macvim"
brew "node"
brew "opa"
brew "openssl@1.1"
brew "openssl@3"
brew "pkg-config"
brew "python@3.10"
brew "sdl2"
brew "speexdsp"
brew "tmux"
brew "zlib"

# cask '1password'
# cask 'brave-browser'
# cask 'discord'
# cask 'firefox'
# cask 'ledger-live'
# cask 'slack'
# cask 'telegram-desktop'
# cask 'visual-studio-code'
# cask 'warp'
# cask 'whatsapp'
# cask 'zoom'
# cask "docker"
# cask "dropbox"
# cask "firefox"
# cask "transmission"
# cask "vlc"
